# 给你一个有 n 个节点的 无向 图，节点编号为 1 到 n 。再给你整数 n 和一个二维整数数组 edges ，其中 edges[i] = [ai, bi] 表示节点 ai 和 bi 之间有一条边。图不一定连通。
#
# 你可以给图中添加 至多 两条额外的边（也可以一条边都不添加），使得图中没有重边也没有自环。
#
# 如果添加额外的边后，可以使得图中所有点的度数都是偶数，返回 true ，否则返回 false 。
#
# 点的度数是连接一个点的边的数目。
#
#
#
# 示例 1：
#
#
#
# 输入：n = 5, edges = [[1,2],[2,3],[3,4],[4,2],[1,4],[2,5]]
# 输出：true
# 解释：上图展示了添加一条边的合法方案。
# 最终图中每个节点都连接偶数条边。
# 示例 2：
#
#
#
# 输入：n = 4, edges = [[1,2],[3,4]]
# 输出：true
# 解释：上图展示了添加两条边的合法方案。
# 示例 3：
#
#
#
# 输入：n = 4, edges = [[1,2],[1,3],[1,4]]
# 输出：false
# 解释：无法添加至多 2 条边得到一个符合要求的图。
#
#
# 提示：
#
# 3 <= n <= 105
# 2 <= edges.length <= 105
# edges[i].length == 2
# 1 <= ai, bi <= n
# ai != bi
# 图中不会有重边

from leetcode.allcode.competition.mypackage import *

class Solution:
    def isPossible(self, n: int, edges: List[List[int]]) -> bool:
        d = defaultdict(set)
        for x, y in edges:
            d[x].add(y)
            d[y].add(x)
        odds = []
        for i in range(1, n + 1):
            if len(d[i]) & 1:
                odds.append(i)
        print(odds)
        if len(odds) == 0:
            return True
        if len(odds) > 4:
            return False
        if len(odds) == 2:
            if odds[1] not in d[odds[0]]:
                return True
            inter = d[odds[0]] | d[odds[1]]
            if len(inter) < n:
                return True
            return False
        if odds[0] not in d[odds[1]] and odds[2] not in d[odds[3]]:
            return True
        if odds[0] not in d[odds[2]] and odds[1] not in d[odds[3]]:
            return True
        if odds[0] not in d[odds[3]] and odds[1] not in d[odds[2]]:
            return True
        return False




so = Solution()
print(so.isPossible(n = 21, edges = [[2,19],[16,17],[8,14],[2,16],[12,20],[12,14],[16,18],[15,16],[10,21],[3,5],[13,18],[17,20],[14,17],[9,12],[5,15],[5,6],[3,7],[2,21],[10,13],[8,16],[7,18],[4,6],[9,1],[13,21],[18,20],[7,14],[4,19],[5,8],[3,11],[11,1],[7,12],[4,7],[3,16],[13,17],[17,19],[9,13],[7,19],[10,16],[4,13],[4,5],[2,15],[12,19],[11,16],[2,9],[11,17],[17,1],[16,21],[4,10],[10,14],[14,16],[4,1],[13,20],[5,20],[4,14],[4,21],[10,20],[2,14],[8,15],[4,8],[6,19],[15,1],[19,1],[8,19],[15,21],[3,12],[11,18],[9,17],[18,19],[7,21],[3,21],[16,19],[11,15],[5,1],[8,17],[3,15],[8,1],[10,19],[3,8],[6,16],[2,8],[5,18],[11,13],[11,20],[14,21],[6,20],[4,20],[12,13],[5,12],[10,11],[9,15],[3,19],[9,20],[14,18],[21,1],[13,19],[8,21],[2,13],[3,10],[9,18],[19,21],[6,7],[3,18],[2,18],[6,14],[3,17],[5,21],[14,20],[8,9],[16,1],[3,4],[13,1],[5,9],[4,15],[17,21],[20,21],[2,17],[13,14],[11,14],[9,16],[10,18],[6,15],[6,12],[3,13],[5,11],[6,1],[12,17],[8,10],[5,10],[8,18],[4,12],[10,1],[6,13],[4,18],[7,20],[7,16],[2,6],[12,21],[4,17],[15,18],[13,16],[15,20],[7,10],[6,10],[2,20],[7,15],[18,1],[12,1],[3,20],[7,1],[14,15],[4,9],[11,19],[7,9],[5,17],[18,21],[6,21],[8,11],[6,17],[3,14],[7,11],[5,7],[7,13],[6,8],[6,9],[10,12],[5,16],[2,4],[17,18],[9,11],[12,16],[3,6],[12,18],[3,9],[11,12],[14,19],[10,15],[5,13],[8,13],[15,17],[2,10],[11,21],[20,1],[6,18],[2,12],[19,20],[6,11],[8,12],[2,3],[12,15],[2,11],[9,10],[7,17],[9,19],[13,15],[7,8],[4,11],[2,5],[5,19],[16,20],[15,19],[9,14],[14,1],[10,17],[9,21],[2,7],[8,20],[5,14],[4,16]]))
print(so.isPossible(n = 5, edges = [[5,1],[1,3]]))
print(so.isPossible(n = 5, edges = [[1,2],[2,3],[3,4],[4,2],[1,4],[2,5]]))
print(so.isPossible(n = 4, edges = [[1,2],[3,4]]))
print(so.isPossible(n = 4, edges = [[1,2],[1,3],[1,4]]))




